SiliconLabs/arduino/variants/bgm220explorerkit/ble_silabs/include/sl_clock_manager.h
// -----------------------------------------------------------------------------
// Prototypes

/***************************************************************************//**
 * Performs Clock Manager runtime initialization.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t sl_clock_manager_runtime_init(void);

/***************************************************************************//**
 * Gets frequency of given oscillator.
 *
 * @param[in] oscillator  Oscillator
 *
 * @param[out] frequency  Oscillator's frequency in Hertz
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_CLOCK_MANAGER, SL_CODE_CLASS_TIME_CRITICAL)
sl_status_t sl_clock_manager_get_oscillator_frequency(sl_oscillator_t oscillator,
                                                      uint32_t *frequency);

/***************************************************************************//**
 * Gets precision of given oscillator.
 *
 * @param[in] oscillator  Oscillator
 *
 * @param[out] precision  Oscillator's precision in PPM
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t sl_clock_manager_get_oscillator_precision(sl_oscillator_t oscillator,
                                                      uint16_t *precision);

/***************************************************************************//**
 * Gets frequency of given clock branch.
 *
 * @param[in] clock_branch  Clock Branch
 *
 * @param[out] frequency    Clock Branch's frequency in Hertz
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_CLOCK_MANAGER, SL_CODE_CLASS_TIME_CRITICAL)
sl_status_t sl_clock_manager_get_clock_branch_frequency(sl_clock_branch_t clock_branch,
                                                        uint32_t *frequency);

/***************************************************************************//**
 * Gets precision of given clock branch.
 *
 * @param[in] clock_branch  Clock Branch
 *
 * @param[out] precision    Clock Branch's precision in PPM
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t sl_clock_manager_get_clock_branch_precision(sl_clock_branch_t clock_branch,
                                                        uint16_t *precision);

/***************************************************************************//**
 * Enables the given module's bus clock.
 *
 * @param[in] module_bus_clock  module's bus clock to enable.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 *
 * @note modules' bus clocks are defined in the
 *       @ref device_clock in the Bus Clock Defines section.
 ******************************************************************************/
sl_status_t sl_clock_manager_enable_bus_clock(sl_bus_clock_t module_bus_clock);

/***************************************************************************//**
 * Disables the given module's bus clock.
 *
 * @param[in] module_bus_clock  module's bus clock to disable.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 *
 * @note modules' bus clocks are defined in the
 *       @ref device_clock in the Bus Clock Defines section.
 ******************************************************************************/
sl_status_t sl_clock_manager_disable_bus_clock(sl_bus_clock_t module_bus_clock);

/***************************************************************************//**
 * Configures one clock export output with specified clock source.
 *
 * @param[in] export_clock_source One of the exportable clock source.
 *
 * @param[in] output_select       Selected export clock output channel.
 *
 * @param[in] hfexp_divider       HFEXP clock divider (1 to 32).
 *                                Note: This parameter only affects the EXPCLK
 *                                      branch frequency.
 *
 * @param[in] port                GPIO port to output exported clock.
 *
 * @param[in] pin                 GPIO pin number to output exported clock.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t sl_clock_manager_set_gpio_clock_output(sl_clock_manager_export_clock_source_t export_clock_source,
                                                   sl_clock_manager_export_clock_output_select_t output_select,
                                                   uint16_t hfexp_divider,
                                                   uint32_t port,
                                                   uint32_t pin);

/***************************************************************************//**
 * Sets the RC oscillator frequency tuning control.
 *
 * @param[in] oscillator  RC Oscillator to set tuning value for.
 *
 * @param[in] val  The RC oscillator frequency tuning setting to use.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 *
 * @note RC Oscillator tuning is done during production, and the tuning value is
 *       loaded after a reset by the Clock Manager initialization code.
 *       Changing the tuning value from the calibrated value is for more advanced
 *       use. Certain oscillators also have build-in tuning optimization.
 *
 * @note Supported RC oscillators include:
 *        - SL_OSCILLATOR_HFRCODPLL
 *        - SL_OSCILLATOR_HFRCOEM23
 *        - SL_OSCILLATOR_LFRCO
 ******************************************************************************/
sl_status_t sl_clock_manager_set_rc_oscillator_calibration(sl_oscillator_t oscillator,
                                                           uint32_t val);

/***************************************************************************//**
 * Gets the RC oscillator frequency tuning setting.
 *
 * @param[in] oscillator  An RC oscillator to get tuning value for.
 *
 * @param[out] val The RC oscillator frequency tuning setting in use.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 *
 * @note Supported RC oscillators include:
 *       - SL_OSCILLATOR_HFRCODPLL
 *       - SL_OSCILLATOR_HFRCOEM23
 *       - SL_OSCILLATOR_LFRCO
 ******************************************************************************/
sl_status_t sl_clock_manager_get_rc_oscillator_calibration(sl_oscillator_t oscillator,
                                                           uint32_t *val);

/***************************************************************************//**
 * Sets the HFXO calibration value.
 *
 * @param[in] val
 *   The HFXO calibration setting to use.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t sl_clock_manager_set_hfxo_calibration(uint32_t val);

/***************************************************************************//**
 * Gets the HFXO calibration value.
 *
 * @param[out] val  The current HFXO calibration value.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t sl_clock_manager_get_hfxo_calibration(uint32_t *val);

/***************************************************************************//**
 * Sets the HFXO's CTUNE.
 *
 * @param[in] ctune  The HFXO's CTUNE value.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 *
 * @note  Sets the XI value to the given ctune value and sets the XO value based
 *        on that same value, but with an offset that is hardware dependent.
 *        Updating CTune while the crystal oscillator is running can
 *        result in significant clock glitches for one XO clock period.
 *        Should be used with caution.
 ******************************************************************************/
sl_status_t slx_clock_manager_hfxo_set_ctune(uint32_t ctune);

/***************************************************************************//**
 * Gets the HFXO's CTUNE.
 *
 * @param[out] ctune  The returned HFXO's CTUNE value.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 *
 * @note  This function only returns the CTUNE XI value.
 *        The XO value follows the XI value with a fixed delta that is
 *        hardware dependent.
 ******************************************************************************/
sl_status_t slx_clock_manager_hfxo_get_ctune(uint32_t *ctune);

/***************************************************************************//**
 * Updates the tuning capacitances and calibrate the Core Bias Current.
 *
 * @param[in] ctune  The HFXO's CTUNE value.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 *
 * @note  Calibrating the CTUNE is time consuming and will cause glitches on the
 *        HFXO's clock. Care and caution should be taken when using this API.
 ******************************************************************************/
sl_status_t slx_clock_manager_hfxo_calibrate_ctune(uint32_t ctune);

/***************************************************************************//**
 * Sets the LFXO frequency tuning control.
 *
 * @param[in] val  The LFXO frequency tuning setting to use.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t sl_clock_manager_set_lfxo_calibration(uint32_t val);

/***************************************************************************//**
 * Gets the LFXO frequency tuning setting.
 *
 * @param[out] val  The LFXO frequency tuning setting to use.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t sl_clock_manager_get_lfxo_calibration(uint32_t *val);

/***************************************************************************//**
 * Configures the RCO calibration.
 *
 * @param[in] cycles  Number of cycles to run calibration. Increasing this
 *                    number increases precision, but the calibration will
 *                    take more time.
 *
 * @param[in] down_counter_selection
 *   The clock which will be counted down cycles.
 *
 * @param[in] up_counter_selection
 *   The number of cycles generated by this clock will be counted and
 *   added up, the result can be given with
 *   sl_clock_manager_get_rco_calibration_count().
 *
 * @param[in] continuous_calibration
 *    Flag when true configures continuous calibration.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 *
 * @note RCO calibration related functions are not thread-safe and should
 *       therefore not be called across multiple tasks.
 ******************************************************************************/
sl_status_t sl_clock_manager_configure_rco_calibration(uint32_t cycles,
                                                       sl_clock_manager_clock_calibration_t down_counter_selection,
                                                       sl_clock_manager_clock_calibration_t up_counter_selection,
                                                       bool continuous_calibration);

/***************************************************************************//**
 * Starts the RCO calibration.
 *
 * @note RCO calibration related functions are not thread-safe and should
 *       therefore not be called across multiple tasks.
 ******************************************************************************/
void sl_clock_manager_start_rco_calibration(void);

/***************************************************************************//**
 * Stops the RCO calibration.
 *
 * @note RCO calibration related functions are not thread-safe and should
 *       therefore not be called across multiple tasks.
 ******************************************************************************/
void sl_clock_manager_stop_rco_calibration(void);

/***************************************************************************//**
 * Waits for the RCO calibration to finish.
 *
 * @note RCO calibration related functions are not thread-safe and should
 *       therefore not be called across multiple tasks.
 ******************************************************************************/
void sl_clock_manager_wait_rco_calibration(void);

/***************************************************************************//**
 * Gets calibration count value, returns the value of the up counter.
 *
 * @param[out] count  Calibration count value.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 *
 * @note RCO calibration related functions are not thread-safe and should
 *       therefore not be called across multiple tasks.
 ******************************************************************************/
sl_status_t sl_clock_manager_get_rco_calibration_count(uint32_t *count);

/***************************************************************************//**
 * Waits for USBPLL clock to be ready.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
sl_status_t sl_clock_manager_wait_usbpll(void);

/***************************************************************************//**
 * When this callback function is called, it means that HFXO failed twice in
 * a row to start with normal configurations. This may mean that there is a
 * bad crystal. When getting this callback, HFXO is running but its properties
 * (frequency, precision) are not guaranteed. This should be considered as an
 * error situation.
 *
 * @note This callback will be called only when the
 *       SL_CLOCK_MANAGER_HFXO_SLEEPY_CRYSTAL_SUPPORT config is enabled
 ******************************************************************************/
void sl_clock_manager_hfxo_notify_consecutive_failed_startups(void);

/***************************************************************************//**
 * Sets the external FLASH reference clock.
 *
 * @param[in] oscillator  Oscillator used to clock the external FLASH.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 *
 * @note This API is not thread-safe and should therefore not be called
 *       across multiple tasks.
 ******************************************************************************/
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_CLOCK_MANAGER, SL_CODE_CLASS_TIME_CRITICAL)
sl_status_t sl_clock_manager_set_ext_flash_clk(sl_oscillator_t oscillator);

/***************************************************************************//**
 * Gets the external FLASH clock source.
 *
 * @param[out] oscillator Oscillator used to clock the external FLASH.
 *
 * @return  Status code.
 *          SL_STATUS_OK if successful. Error code otherwise.
 ******************************************************************************/
SL_CODE_CLASSIFY(SL_CODE_COMPONENT_CLOCK_MANAGER, SL_CODE_CLASS_TIME_CRITICAL)
sl_status_t sl_clock_manager_get_ext_flash_clk(sl_oscillator_t *oscillator);

/** @} (end addtogroup clock_manager) */

#ifdef __cplusplus
}
#endif

#endif // SL_CLOCK_MANAGER_H
